{
  "title": "The Black Jacobins",
  "subtitle": "Toussaint L'Ouverture and the San Domingo Revolution",
  "publishers": [
    "Vintage Books"
  ],
  "authors": [
    "C.L.R. James II"
  ],
  "genre": [
    "History",
    "Biography",
    "Revolutionaries",
    "Generals",
    "Revolution, 1791-1804",
    "Vrijheidsoorlogen",
    "Histoire",
    "Slaven (arbeid)",
    "Toussaint louverture, 1743?-1803",
    "Haiti, history",
    "American history: c 1800 to c 1900",
    "Social history",
    "History - General History",
    "Toussaint Louverture,",
    "History: World",
    "Haiti",
    "Caribbean & West Indies - General",
    "History / Caribbean & West Indies",
    "1743?-1803",
    "Toussaint Louverture, Pierre Dominique",
    "Toussaint Louverture, 1743-1803",
    "CHR 1989",
    "Französische Revolution",
    "Revolution (Haiti : 1791-1804) fast (OCoLC)fst01354524",
    "Jakobiner",
    "Entstehung",
    "PRO Gotham Book Mart (former owner) (Gotham Book Mart Collection copy)",
    "Auswirkung"
  ],
  "isbn": [
    "9780679724674"
  ],
  "status": "to-read",
  "description": "En 1789, les deux tiers du commerce extérieur de la France se faisaient avec sa colonie antillaise de Saint-Domingue, laquelle représentait le plus grand marché de la traite européenne des esclaves. La plus grosse colonie du monde, fierté de la France et objet de convoitise de toutes les autres nations impérialistes, faisait partie intégrante de la vie économique d'alors. Tout cet ensemble reposait sur le labeur d'un demi-million d'esclaves. \r\n\r\nAu mois d'août 1791, après deux ans de Révolution française avec ses répercussions à Saint-Domingue, les esclaves entrèrent en révolte. Leur lutte dura douze ans. Ils mirent tour à tour en déroute les Blancs locaux et les soldats de la monarchie française, une invasion espagnole, une expédition britannique de près de 60 000 hommes, et un contingent français identique, commandé par le propre beau-frère de Bonaparte. La défaite des troupes napoléoniennes, en 1803, permit l'installation de l'État nègre d'Haïti, qui s'est maintenu jusqu'à nos jours.\r\n\r\nC'est la seule révolte d'esclaves dont l'histoire ait enregistré le succès. Les obstacles qu'elle dut franchir témoignent de l'importance des intérêts qui étaient en jeu. La transformation des esclaves, qui auparavant tremblaient par centaines face à un seul Blanc, en un peuple capable de s'organiser et de défaire les nations européennes les plus puissantes de l'époque, constitue une des grandes épopées de la bataille et de la réussite révolutionnaires. Le pourquoi et le comment de ce phénomène, tels sont les thèmes de ce livre.",
  "pages": 426,
  "published": "1989-10-01T04:00:00.000Z",
  "image": "./9780679724674.jpg",
  "color": {
    "value": [
      98,
      62,
      103,
      255
    ],
    "rgb": "rgb(98,62,103)",
    "rgba": "rgba(98,62,103,1)",
    "hex": "#623e67",
    "hexa": "#623e67ff",
    "isDark": true,
    "isLight": false
  },
  "weight": null,
  "dimensions": {
    "height": 19,
    "width": 13,
    "thickness": 2.5
  },
  "googleBooksId": "J-JYEAAAQBAJ"
}